simpleProcess/airfoil_OFJ_pitching/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    "(inlet)"
    {
        type            fixedValue;
	value		$internalField;
    }

    outlet
    {
        type            inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }


    topAndBottom
    {
        //type            symmetry;
        type            inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }


    shape
    {
        type            noSlip;
    }

    defaultFaces
    {
        type            empty;
    }

    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }

    AMI2
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
